{
	"paralax.title": "¡Hello World!",

	"header.about": "About me",
	"header.skills": "Skills",
	"header.projects": "Projects",
	"header.contact": "Contact",

	"information.about.title": "About me",
	"information.about.p1": "I am Jhon Camargo, the person behind these lines and I belong to that generation called centennials.",
	"information.about.p2": "I was born in one of the three most beautiful countries on Earth. There is an explosion of life there. Thousands of multicolored species in the seas, in the skies, in the lands... I grew up in the land of yellow butterflies and magic. My country is beautiful because it has the Amazon jungle, the Choco jungle, the waters, the Andes mountain ranges, and the oceans. I am Colombian.",
	"information.about.p3": "I grew up in a world where technology innovated every day, I saw how we changed from the keypad cell phone to the Smartphone, I saw how technology was more and more present in our daily lives. Until today, where everything moves from it. I am glad to be part of this era and contribute with my knowledge.",
	"information.about.personal": "Personally...",
	"information.about.personal.p1": "Soy una persona tranquila, me gusta hacer deporte, algunos fines de semana salgo a trotar. El deporte que más me gusta es el futbol, pero el básquet y el tenis de mesa. Me gusta escuchar música y más que solo escucharla, me gusta analizar las letras de cada canción.",
	"information.about.personal.p2": "Although I do not read much, I am beginning to cultivate the habit of reading. I am interested in politics and although I don't know much about it, I consider that it should be in every person because there is nothing more important than choosing correctly the people who will lead the country. I also like philosophy, critical thinking.",
	"information.about.professional": "Professionally...",
	"information.about.professional.p1": "In 2022 I participated in the biggest competition that Sena has, SenaSoft. It is a hackathon in which the best programmers from all over the country meet to solve a test assigned by companies in the productive sector. In this competition there were many categories, I participated in the category of free development along with a fellow programmer. The challenge we were assigned was to make a game, with which we managed to position ourselves in the number 6 position. Twenty-seven teams participated in this category.",
	"information.about.professional.p2": "Participating in this competition made me realize the shortcomings that I had at that time, so from the moment the hackathon ended I started working on them. I am very proud to say that I participated in SenaSoft because it was the result of my effort, love and dedication to this great industry. And although the result was not what I expected, I gained much more than what I might have lost. That's what it's all about, isn't it? Learning from failures, so I'm sure I learned from them.",
	"information.about.professional.p3": "I am currently doing a technologist at the Sena training center, but my study goals do not go this far, I want to do a specialization in systems engineering.",
	"information.about.professional.p4": "During the years that I have been a programmer I have developed different projects on my own that have served me as practice and have given me experience in this field. I don't have a defined programming language, I do very well in JAVA, PHP, Python, JavaScript, but the one I love the most is Python. Every day I learn new things, I like to be investigating new technologies, I never stop learning.",
	"information.about.professional.p5": "Although I don't have a degree in computer repair, my curiosity has led me to learn many things in the hardware part. I myself have learned how to do maintenance and repairs to computers, so much so that I managed to build my first gamer pc by myself. I remember that since I was a kid I have liked everything related to software and hardware.",

	"error404.title": "Sorry, page not found",
	"error404.p1": "But don't worry, it's just a 404 error!",
	"error404.p2": "It is possible that what you are looking for no longer exists or the link is misspelled.",
	"error404.buttom": "Back to main page",

	"error403.title": "Sorry, access denied",
	"error403.p1": "Pero no se preocupe, ¡Es solo un error 403!",
	"error403.p2": "It is possible that the link is misspelled or that you do not have privileges to access this content.",
	"error403.buttom": "Back to main page",

	"skills.title": "Skills",
	"skills.language.experience": "Experience:",
	"skills.language.years": "year",
	"skills.language.expert": "Expert",
	"skills.language.advanced": "Advanced",
	"skills.language.beginner": "Beginner",
	"skills.language.intermediate": "Intermediate",

	"form.title": "Contact me",
	"form.label.name": "Name",
	"form.input.name": "John doe",
	"form.label.email": "Email",
	"form.input.email": "correo@correo.com",
	"form.label.motive": "Motive",
	"form.input.motive": "Request for your services",
	"form.label.message": "Message",
	"form.input.message": "Please tell me why you are contacting me.",
	"form.buttom": "Submit",

	"form.input.name.empty": "Please enter your name",
	"form.input.name.incorrect": "The name can only contain letters and spaces",
	"form.input.email.empty": "Please enter your email address",
	"form.input.email.incorrect": "Mail can only contain letters, numbers, periods, hyphens and underscores",
	"form.input.motive.empty": "Please enter the reason why you are contacting me",
	"form.input.motive.incorrect": "The motif must be between 10 and 100 characters long and can only contain letters, numbers, periods, hyphens and underscores",
	"form.input.message.empty": "Please enter your message",
	"form.input.message.incorrect": "The message must be at least 10 characters long, it can only contain letters, numbers, dots, hyphens and underscores",

	"form.message.incorrect": "Please fill in the form correctly",
	"form.message.correct": "¡Form successfully submitted!",
	"form.message.failed": "A problem has occurred, our site is experiencing errors.",

	"footer.description": " | Portfolio ",
	"footer.description.name": "Jhon Camargo",
	"footer.technologies": "This page was developed with React, Sass and PHP.",
	"footer.copyright": "Version 2.0 | Copyright ©",
	"footer.notice.legal": "Legal Notice",
	"footer.projects": "Projects",

	"notice.legal.title": "Aviso legal",
	"notice.legal.p1": "Es esta página encontrarás toda la información sobre el aviso legal, el tratamiento de los datos y la política de cookies",

	"notice.legal.conditions.title": "1. Aviso legal y condiciones de uso de esta web",
	"notice.legal.conditions.p1": "La utilización de esta página está sujeta a las siguientes condiciones de uso que pedimos lea atentamente.",
	"notice.legal.conditions.object.title": "Objeto",
	"notice.legal.conditions.object.p1": "El responsable del sitio web (en adelante, Jhon Camargo) pone a disposición de los usuarios el presente documento con el fin de cumplir con las obligaciones establecidas en la Ley 34/2002, de Servicios de la Sociedad de la Información y del Comercio Electrónico (LSSICE). Además, se pretende informar a todos los usuarios del sitio web sobre las condiciones de uso del mismo.",
	"notice.legal.conditions.object.p2": "Al ingresar a este sitio web, toda persona asuma el papel de USUARIO y se compromete a cumplir de manera estricta las disposiciones establecidas aquí, así como cualquier otra ley aplicable.",

	"notice.legal.conditions.responsability.title": "Responsabilidad",
	"notice.legal.conditions.responsability.p1": "El prestador del sitio web se desliga de cualquier responsabilidad que pudiera derivarse de la información publicada en el sitio, en el caso de que dicha información haya sido manipulada o introducida por terceros ajenos al prestador.",
	"notice.legal.conditions.responsability.p2": "Este sitio web puede contener enlaces o enlaces que redirijan a los usuarios a otros sitios y páginas web gestionados por terceros, sobre los cuales Jhon Camargo no tiene control alguno. En estos casos, Jhon Camargo actúa como prestador de servicios de intermediación de acuerdo con lo establecido en el artículo 17 de la LSSICE. Jhon Camargo no se responsabiliza ni del contenido ni del estado de dichos sitios y páginas web.",
	"notice.legal.conditions.responsability.p3": "El prestador no se hace responsable de la información y los contenidos almacenados, incluyendo, entre otros, en foros, chats, generadores de blogs, comentarios, redes sociales u otros medios que permitan a terceros publicar contenidos de forma independiente en el sitio web del prestador. Sin embargo, de acuerdo con lo establecido en los artículos 11 y 16 de la LSSICE, el prestador se pone a disposición de todos los usuarios, autoridades y fuerzas de seguridad, colaborando activamente en la retirada o bloqueo de cualquier contenido que pueda infringir la legislación nacional o internacional, los derechos de terceros, o la moral y el orden público.",

	"notice.legal.conditions.intellectual.property.title": "Derechos de propiedad industrial e intelectual",
	"notice.legal.conditions.intellectual.property.p1": "El Usuario reconoce y acepta que todos los derechos de propiedad industrial e intelectual sobre los contenidos y demás elementos insertados en el Sitio Web pertenecen a Jhon Camargo.",
	"notice.legal.conditions.intellectual.property.p2": "El contenido completo del sitio web, incluyendo, entre otros, su programación, edición, compilación y demás elementos necesarios para su funcionamiento, así como los diseños, logotipos, texto y/o gráficos, imágenes y material gráfico o artístico presentes en el sitio web, son propiedad del prestador o cuentan con licencia o autorización expresa por parte de los autores. Todos los contenidos del sitio web están protegidos por derechos de propiedad industrial e intelectual, registrados en los correspondientes registros públicos bajo la titularidad de Jhon Camargo o terceros, y el Usuario no adquiere ningún derecho de explotación sobre los mismos, más allá de lo estrictamente necesario para el uso adecuado de del sitio web.",
	"notice.legal.conditions.intellectual.property.p3": "Se permite a cualquier persona natural o jurídica establecer enlaces en sus páginas o sitios web hacia el sitio web, tanto a su página principal como a cualquiera de sus páginas. Sin embargo, queda expresamente prohibido enlazar directamente a cualquier página del sitio web que implique visualizarlas en un marco o frame dentro del navegador.",

	"notice.legal.conditions.data.protection.title": "Protección de datos",
	"notice.legal.conditions.data.protection.p1": "De acuerdo con la normativa vigente en protección de datos y servicios de la sociedad de la información, el Usuario acepta que los datos personales proporcionados en el momento de contacto u otros facilitados a Jhon Camargo sean compartidos con el propietario, Jhon Camargo, con el fin de recopilar la información necesaria para responder a solicitudes de información, contacto, contratación y/o presupuestos, así como para cobros y pagos.",
	"notice.legal.conditions.data.protection.p2": "Además, se utilizarán para enviar información relevante sobre el tema en cuestión (mensajes del usuario) a través del correo electrónico. El usuario otorga su consentimiento expreso para recibir comunicaciones a través de este medio.",
	"notice.legal.conditions.data.protection.p3": "El Usuario tiene derecho a revocar el consentimiento otorgado para el envío de comunicaciones, así como a ejercer sus derechos de acceso, rectificación, cancelación y oposición. Estos derechos se pueden ejercer mediante una comunicación escrita a través del formulario de contacto.",

	"notice.legal.conditions.law.title": "Ley aplicable y de jurisdicción",
	"notice.legal.conditions.law.p1": "Para resolver cualquier controversia o asunto relacionado con este sitio web o las actividades llevadas a cabo en él, se aplicará la legislación colombiana. Las partes se someten expresamente a dicha legislación y los Juzgados y Tribunales de Bogotá serán competentes para resolver cualquier conflicto derivado o relacionado con el uso del sitio."
}
