{
	"project.title": "Porfolio Jhon Camargo",

	"paralax.title": "¡Hello World!",

	"header.about": "About me",
	"header.skills": "Skills",
	"header.projects": "Projects",
	"header.contact": "Contact",

	"information.about.title": "About me",
	"information.about.p1": "I am Jhon Camargo, the person behind these lines and I belong to that generation called centennials.",
	"information.about.p2": "I was born in one of the three most beautiful countries on Earth. There is an explosion of life there. Thousands of multicolored species in the seas, in the skies, in the lands... I grew up in the land of yellow butterflies and magic. My country is beautiful because it has the Amazon jungle, the Choco jungle, the waters, the Andes mountain ranges, and the oceans. I am Colombian.",
	"information.about.p3": "I grew up in a world where technology innovated every day, I saw how we changed from the keypad cell phone to the Smartphone, I saw how technology was more and more present in our daily lives. Until today, where everything moves from it. I am glad to be part of this era and contribute with my knowledge.",
	"information.about.personal": "Personally...",
	"information.about.personal.p1": "Soy una persona tranquila, me gusta hacer deporte, algunos fines de semana salgo a trotar. El deporte que más me gusta es el futbol, pero el básquet y el tenis de mesa. Me gusta escuchar música y más que solo escucharla, me gusta analizar las letras de cada canción.",
	"information.about.personal.p2": "Although I do not read much, I am beginning to cultivate the habit of reading. I am interested in politics and although I don't know much about it, I consider that it should be in every person because there is nothing more important than choosing correctly the people who will lead the country. I also like philosophy, critical thinking.",
	"information.about.professional": "Professionally...",
	"information.about.professional.p1": "In 2022 I participated in the biggest competition that Sena has, SenaSoft. It is a hackathon in which the best programmers from all over the country meet to solve a test assigned by companies in the productive sector. In this competition there were many categories, I participated in the category of free development along with a fellow programmer. The challenge we were assigned was to make a game, with which we managed to position ourselves in the number 6 position. Twenty-seven teams participated in this category.",
	"information.about.professional.p2": "Participating in this competition made me realize the shortcomings that I had at that time, so from the moment the hackathon ended I started working on them. I am very proud to say that I participated in SenaSoft because it was the result of my effort, love and dedication to this great industry. And although the result was not what I expected, I gained much more than what I might have lost. That's what it's all about, isn't it? Learning from failures, so I'm sure I learned from them.",
	"information.about.professional.p3": "I am currently doing a technologist at the Sena training center, but my study goals do not go this far, I want to do a specialization in systems engineering.",
	"information.about.professional.p4": "During the years that I have been a programmer I have developed different projects on my own that have served me as practice and have given me experience in this field. I don't have a defined programming language, I do very well in JAVA, PHP, Python, JavaScript, but the one I love the most is Python. Every day I learn new things, I like to be investigating new technologies, I never stop learning.",
	"information.about.professional.p5": "Although I don't have a degree in computer repair, my curiosity has led me to learn many things in the hardware part. I myself have learned how to do maintenance and repairs to computers, so much so that I managed to build my first gamer pc by myself. I remember that since I was a kid I have liked everything related to software and hardware.",

	"error404.title": "Sorry, page not found",
	"error404.p1": "But don't worry, it's just a 404 error!",
	"error404.p2": "It is possible that what you are looking for no longer exists or the link is misspelled.",
	"error404.buttom": "Back to main page",

	"error403.title": "Sorry, access denied",
	"error403.p1": "Pero no se preocupe, ¡Es solo un error 403!",
	"error403.p2": "It is possible that the link is misspelled or that you do not have privileges to access this content.",
	"error403.buttom": "Back to main page",

	"skills.title": "Skills",
	"skills.language.experience": "Experience:",
	"skills.language.years": "year",
	"skills.language.expert": "Expert",
	"skills.language.advanced": "Advanced",
	"skills.language.beginner": "Beginner",
	"skills.language.intermediate": "Intermediate",

	"form.title": "Contact me",
	"form.label.name": "Name",
	"form.input.name": "John doe",
	"form.label.email": "Email",
	"form.input.email": "correo@correo.com",
	"form.label.motive": "Motive",
	"form.input.motive": "Request for your services",
	"form.label.message": "Message",
	"form.input.message": "Please tell me why you are contacting me.",
	"form.buttom": "Submit",

	"form.input.name.empty": "Please enter your name",
	"form.input.name.incorrect": "The name can only contain letters and spaces",
	"form.input.email.empty": "Please enter your email address",
	"form.input.email.incorrect": "Mail can only contain letters, numbers, periods, hyphens and underscores",
	"form.input.motive.empty": "Please enter the reason why you are contacting me",
	"form.input.motive.incorrect": "The motif must be between 10 and 100 characters long and can only contain letters, numbers, periods, hyphens and underscores",
	"form.input.message.empty": "Please enter your message",
	"form.input.message.incorrect": "The message must be at least 10 characters long, it can only contain letters, numbers, dots, hyphens and underscores",

	"form.message.incorrect": "Please fill in the form correctly",
	"form.message.correct": "¡Form successfully submitted!",
	"form.message.failed": "A problem has occurred, our site is experiencing errors.",

	"footer.description": " | Portfolio ",
	"footer.description.name": "Jhon Camargo",
	"footer.technologies": "This page was developed with React, Sass and PHP.",
	"footer.copyright": "Version 2.0 | Copyright ©",
	"footer.notice.legal": "Legal Notice",
	"footer.projects": "Projects",

	"notice.legal.title": "Legal Notice",
	"notice.legal.p1": "On this page you will find all the information about the legal notice, data processing and cookies policy.",

	"notice.legal.conditions.title": "1. Legal notice and terms of use of this website",
	"notice.legal.conditions.p1": "The use of this site is subject to the following terms of use, which we ask you to read carefully.",
	"notice.legal.conditions.object.title": "Object",
	"notice.legal.conditions.object.p1": "The person responsible for the website (hereinafter, Jhon Camargo) makes this document available to users in order to comply with the obligations established in Law 34/2002, of Services of the Information Society and Electronic Commerce (LSSICE). In addition, it is intended to inform all users of the website about the conditions of use of the same.",
	"notice.legal.conditions.object.p2": "By accessing this website, each person assumes the role of USER and agrees to strictly comply with the provisions set forth herein, as well as any other applicable law.",

	"notice.legal.conditions.responsability.title": "Responsibility",
	"notice.legal.conditions.responsability.p1": "The provider of the website disclaims any liability that may arise from the information published on the site, in the event that such information has been manipulated or introduced by third parties outside the provider.",
	"notice.legal.conditions.responsability.p2": "This website may contain links or links that redirect users to other websites and web pages managed by third parties, over which Jhon Camargo has no control. In these cases, Jhon Camargo acts as an intermediary service provider in accordance with the provisions of Article 17 of the LSSICE. Jhon Camargo is not responsible for the content and status of such websites and web pages.",
	"notice.legal.conditions.responsability.p3": "The provider is not responsible for the information and content stored, including, among others, in forums, chats, blog generators, comments, social networks or other means that allow third parties to publish content independently on the provider's website. However, in accordance with the provisions of Articles 11 and 16 of the LSSICE, the provider is available to all users, authorities and security forces, actively collaborating in the removal or blocking of any content that may violate national or international law, the rights of third parties, or morality and public order.",

	"notice.legal.conditions.intellectual.property.title": "Industrial and intellectual property rights",
	"notice.legal.conditions.intellectual.property.p1": "The User acknowledges and accepts that all industrial and intellectual property rights over the contents and other elements inserted in the Website belong to Jhon Camargo.",
	"notice.legal.conditions.intellectual.property.p2": "The entire contents of the website, including, among others, its programming, editing, compilation and other elements necessary for its operation, as well as the designs, logos, text and/or graphics, images and graphic or artistic material present on the website, are the property of the provider or are licensed or expressly authorized by the authors. All contents of the website are protected by industrial and intellectual property rights, registered in the corresponding public registries under the ownership of Jhon Camargo or third parties, and the User does not acquire any right to exploit them beyond what is strictly necessary for the proper use of the website.",
	"notice.legal.conditions.intellectual.property.p3": "Any natural or legal person is allowed to establish links on their pages or websites to the website, both to its home page and to any of its pages. However, it is expressly forbidden to link directly to any page of the website that involves displaying them in a frame within the browser.",

	"notice.legal.conditions.data.protection.title": "Data Protection",
	"notice.legal.conditions.data.protection.p1": "In accordance with current legislation on data protection and information society services, the User agrees that the personal data provided at the time of contact or others provided to Jhon Camargo be shared with the owner, Jhon Camargo, in order to collect the necessary information to respond to requests for information, contact, recruitment and / or budgets, as well as for collections and payments.",
	"notice.legal.conditions.data.protection.p2": "In addition, they will be used to send relevant information on the subject in question (messages from the user) through electronic means, such as e-mail. The User expressly consents to receive communications through this means.",
	"notice.legal.conditions.data.protection.p3": "The User has the right to revoke the consent granted for the sending of communications, as well as to exercise their rights of access, rectification, cancellation and opposition. These rights can be exercised by means of a written communication through the contact form.",

	"notice.legal.conditions.law.title": "Applicable law and jurisdiction",
	"notice.legal.conditions.law.p1": "To resolve any dispute or matter related to this website or the activities carried out on it, Colombian law shall apply. The parties expressly submit to such legislation and the Courts and Tribunals of Bogota shall have jurisdiction to resolve any dispute arising from or related to the use of the site."
}
