{
	"paralax.title": "¡Hello World!",

	"header.about": "About me",
	"header.skills": "Skills",
	"header.contact": "Contact",

	"information.about.title": "About me",
	"information.about.p1": "I am Jhon Camargo, the person behind these lines and I belong to that generation called centennials.",
	"information.about.p2": "I was born in one of the three most beautiful countries on Earth. There is an explosion of life there. Thousands of multicolored species in the seas, in the skies, in the lands... I grew up in the land of yellow butterflies and magic. My country is beautiful because it has the Amazon jungle, the Choco jungle, the waters, the Andes mountain ranges, and the oceans. I am Colombian.",
	"information.about.p3": "I grew up in a world where technology innovated every day, I saw how we changed from the keypad cell phone to the Smartphone, I saw how technology was more and more present in our daily lives. Until today, where everything moves from it. I am glad to be part of this era and contribute with my knowledge.",
	"information.about.personal": "Personally...",
	"information.about.personal.p1": "I am a quiet person, I like to do sports, some weekends I go jogging. I like to listen to music and more than just listen to it, I like to analyze the lyrics of each song. I am very interested in listening to stories from the past, anecdotes and even more if they are taken to movies or series.",
	"information.about.personal.p2": "Although I do not read much, I am beginning to cultivate the habit of reading. I am a little interested in politics and although I don't know much about it I consider that it should be in every person because there is nothing more important than choosing correctly the people who will lead the country.",
	"information.about.professional": "Professionally...",
	"information.about.professional.p1": "In 2022 I participated in the biggest competition that Sena has, SenaSoft. It is a hackathon in which the best programmers from all over the country meet to solve a test assigned by companies in the productive sector. In this competition there were many categories, I participated in the category of free development along with a fellow programmer. The challenge we were assigned was to make a game, with which we managed to position ourselves in the number 6 position. Twenty-seven teams participated in this category.",
	"information.about.professional.p2": "Participating in this competition made me realize the shortcomings that I had at that time, so from the moment the hackathon ended I started working on them. I am very proud to say that I participated in SenaSoft because it was the result of my effort, love and dedication to this great industry. And although the result was not what I expected, I gained much more than what I might have lost. That's what it's all about, isn't it? Learning from failures, so I'm sure I learned from them.",
	"information.about.professional.p3": "I am currently doing a technologist at the Sena training center, but my study goals do not go this far, I want to do a specialization in systems engineering.",
	"information.about.professional.p4": "During the years that I have been a programmer I have developed different projects on my own that have served me as practice and have given me experience in this field. I don't have a defined programming language, I do very well in JAVA, PHP, Python, JavaScript, but the one I love the most is Python. Every day I learn new things, I like to be investigating new technologies, I never stop learning.",
	"information.about.professional.p5": "Although I don't have a degree in computer repair, my curiosity has led me to learn many things in the hardware part. I myself have learned how to do maintenance and repairs to computers, so much so that I managed to build my first gamer pc by myself. I remember that since I was a kid I have liked everything related to software and hardware.",

	"error404.title": "Sorry, page not found",
	"error404.p1": "But don't worry, it's just a 404 error!",
	"error404.p2": "It is possible that what you are looking for no longer exists or the link is misspelled.",
	"error404.buttom": "Back to main page",

	"skills.title": "Skills",
	"skills.language.experience": "Experience:",
	"skills.language.years": "year",
	"skills.language.expert": "Expert",
	"skills.language.advanced": "Advanced",
	"skills.language.beginner": "Beginner",
	"skills.language.intermediate": "Intermediate",

	"form.title": "Contact me",
	"form.label.name": "Name",
	"form.input.name": "John doe",
	"form.label.email": "Email",
	"form.input.email": "correo@correo.com",
	"form.label.motive": "Motive",
	"form.input.motive": "Request for your services",
	"form.label.message": "Message",
	"form.input.message": "Please tell me why you are contacting me.",
	"form.buttom": "Submit",

	"form.input.name.empty": "Please enter your name",
	"form.input.name.incorrect": "The name can only contain letters and spaces",
	"form.input.email.empty": "Please enter your email address",
	"form.input.email.incorrect": "Mail can only contain letters, numbers, periods, hyphens and underscores",
	"form.input.motive.empty": "Please enter the reason why you are contacting me",
	"form.input.motive.incorrect": "The motif must be between 10 and 100 characters long and can only contain letters, numbers, periods, hyphens and underscores",
	"form.input.message.empty": "Please enter your message",
	"form.input.message.incorrect": "The message must be at least 10 characters long, it can only contain letters, numbers, dots, hyphens, underscores, underscores, hyphens, and underscores",

	"form.message.incorrect": "Please fill in the form correctly",
	"form.message.correct": "¡Form successfully submitted!",
	"form.message.failed": "A problem has occurred, our site is experiencing errors.",

	"footer.description": " | Portfolio ",
	"footer.description.name": "Jhon Camargo",
	"footer.technologies": "This page was developed with React, Sass and PHP.",
	"footer.copyright": "Version 2.0 | Copyright ©",
	"footer.notice.legal": "Legal Notice",
	"footer.projects": "Projects"
}
