{
	"project.title": "Portafolio Jhon Camargo",

	"paralax.title": "¡Hola Mundo!",

	"header.about": "Sobre mí",
	"header.skills": "Habilidades",
	"header.contact": "Contacto",
	"header.projects": "Proyectos",

	"information.about.title": "Sobre mí",
	"information.about.p1": "Soy Jhon Camargo, la persona que se esconde tras estas líneas y pertenezco a esa generación que llaman centennials.",
	"information.about.p2": "Nací de uno de los tres países más bellos de la Tierra. Allí hay una explosión de vida. Miles de especies multicolores en los mares, en los cielos, en las tierras... crecí en la tierra de las mariposas amarillas y de la magia. Mi país es bello porque tiene la Selva Amazónica, la del Chocó, las aguas, las cordilleras de los Andes, y los océanos. Soy Colombiano.",
	"information.about.p3": "Crecí en un mundo en donde la tecnología innovaba cada día, vi como cambiamos del celular de teclas al Smartphone, vi como cada vez la tecnología estaba más presente en nuestro día a día. Hasta el día de hoy, en donde todo se mueve a partir de ella. Me alegra poder ser parte de esta era y contribuir con mi conocimiento.",
	"information.about.personal": "En lo personal...",
	"information.about.personal.p1": "Soy una persona tranquila, me gusta hacer deporte, algunos fines de semana salgo a trotar. El deporte que más me gusta es el futbol, pero el básquet y el tenis de mesa. Me gusta escuchar música y más que solo escucharla, me gusta analizar las letras de cada canción.",
	"information.about.personal.p2": "Aunque no leo mucho, estoy empezando a cultivar en mí el hábito de leer. Me interesa la política y aunque no sé mucho al respecto, considero que esta debe estar en cada persona porque no hay nada más importante que elegir correctamente a las personas que liderarán el país. También me gusta la filosofía, el pensamiento crítico.",
	"information.about.professional": "En lo profesional...",
	"information.about.professional.p1": "En el 2022 participé en la competencia más grande que tiene el Sena, SenaSoft. Es una hackathon en la que se reúnen los mejores programadores de todo el país para resolver una prueba que asignan empresas del sector productivo. En esta competencia había muchas categorías, yo participé en la categoría de desarrollo libre junto con una colega programadora. El reto que nos asignaron fue realizar un juego, con el cual logramos posicionarnos en el puesto número 6. En esta categoría participaron 27 equipos.",
	"information.about.professional.p2": "Participar en esta competencia me hizo darme cuenta de las falencias que en ese momento tenía, así que desde el momento en que culminó la hackathon comencé a trabajar en ellas. Me enorgullece enormemente poder decir que participé en SenaSoft porque fue el resultado de mi esfuerzo, amor y dedicación a esta gran industria. Y aunque el resultado no fue el esperado, gané mucho más de lo que tal vez perdí. De eso se trata ¿no? De aprender de los fracasos, así que estoy seguro que de ellos aprendí.",
	"information.about.professional.p3": "Actualmente me encuentro haciendo un tecnólogo en el centro de formación Sena, pero mis metas de estudio no llegan hasta aquí, quiero hacer una especialización en ingeniería de sistemas.",
	"information.about.professional.p4": "Durante los años que llevo como programador he desarrollado distintos proyectos por mi cuenta que me han servido como práctica y me han dado experiencia en este ámbito. No tengo un lenguaje de programación definido, me va muy bien en JAVA, PHP, Python, JavaScript, pero a quién más amor le tengo es a Python. Cada día aprendo cosas nuevas, me gusta estar investigando las nuevas tecnologías, nunca paro de aprender.",
	"information.about.professional.p5": "Aunque no cuento con un título en reparación de computadores, mi curiosidad me ha llevado a aprender muchas cosas en la parte del hardware. Yo mismo he aprendido como hacerles mantenimiento y reparaciones a los computadores, tanto así que logré por mi mismo armar mi primera pc gamer. Recuerdo que desde niño me ha gustado todo lo relacionado con software y hardware.",

	"error404.title": "Lo siento, página no encontrada",
	"error404.p1": "Pero no se preocupe, ¡Es solo un error 404!",
	"error404.p2": "Es posible que lo que está buscando ya no exista o el enlace está mal escrito.",
	"error404.buttom": "Volver a la página principal",

	"error403.title": "Lo siento, acceso denegado",
	"error403.p1": "Pero no se preocupe, ¡Es solo un error 403!",
	"error403.p2": "Es posible que el enlace esté mal escrito o que no tiene privilegios para acceder a este contenido",
	"error403.buttom": "Volver a la página principal",

	"skills.title": "Habilidades",
	"skills.language.experience": "Experiencia:",
	"skills.language.years": "año",
	"skills.language.expert": "Experto",
	"skills.language.advanced": "Avanzado",
	"skills.language.beginner": "Principiante",
	"skills.language.intermediate": "Intermedio",

	"form.title": "Contáctame",
	"form.label.name": "Nombre",
	"form.input.name": "John doe",
	"form.label.email": "Correo electrónico",
	"form.input.email": "correo@correo.com",
	"form.label.motive": "Asunto",
	"form.input.motive": "Solicitud de tus servicios",
	"form.label.message": "Mensaje",
	"form.input.message": "Cuéntame cuál es el motivo por el que me contactas",
	"form.buttom": "Enviar",

	"form.input.name.empty": "Por favor ingresa tu nombre",
	"form.input.name.incorrect": "El nombre solo puede contener letras y espacios",
	"form.input.email.empty": "Por favor ingresa tu correo electrónico",
	"form.input.email.incorrect": "El correo solo puede tener letras, números, puntos, guiones y guion bajo",
	"form.input.motive.empty": "Por favor ingresa el motivo por el que me contactas",
	"form.input.motive.incorrect": "El asunto debe ser de 10 a 100 caracteres, solo puede contener letras, números, puntos, guiones y guion bajo",
	"form.input.message.empty": "Por favor ingresa tu mensaje",
	"form.input.message.incorrect": "El mensaje debe tener mínimo 10 caracteres, solo puede contener letras, números, puntos, guiones, guion bajo",
	"form.message.incorrect": "Por favor rellena el formulario correctamente",
	"form.message.correct": "¡Formulario enviado exitosamente!",
	"form.message.failed": "Ocurrió un probema, nuestro sitio está experimentando fallos",

	"footer.description": " | Portafolio ",
	"footer.description.name": "Jhon Camargo",
	"footer.technologies": "Esta página fue desarrollada con React, Sass y PHP",
	"footer.copyright": "Versión 2.0 | Copyright ©",
	"footer.notice.legal": "Aviso legal",
	"footer.projects": "Proyectos",

	"notice.legal.title": "Aviso legal",
	"notice.legal.p1": "Es esta página encontrarás toda la información sobre el aviso legal, el tratamiento de los datos y la política de cookies",

	"notice.legal.conditions.title": "1. Aviso legal y condiciones de uso de esta web",
	"notice.legal.conditions.p1": "La utilización de esta página está sujeta a las siguientes condiciones de uso que pedimos lea atentamente.",
	"notice.legal.conditions.object.title": "Objeto",
	"notice.legal.conditions.object.p1": "El responsable del sitio web (en adelante, Jhon Camargo) pone a disposición de los usuarios el presente documento con el fin de cumplir con las obligaciones establecidas en la Ley 34/2002, de Servicios de la Sociedad de la Información y del Comercio Electrónico (LSSICE). Además, se pretende informar a todos los usuarios del sitio web sobre las condiciones de uso del mismo.",
	"notice.legal.conditions.object.p2": "Al ingresar a este sitio web, toda persona asuma el papel de USUARIO y se compromete a cumplir de manera estricta las disposiciones establecidas aquí, así como cualquier otra ley aplicable.",

	"notice.legal.conditions.responsability.title": "Responsabilidad",
	"notice.legal.conditions.responsability.p1": "El prestador del sitio web se desliga de cualquier responsabilidad que pudiera derivarse de la información publicada en el sitio, en el caso de que dicha información haya sido manipulada o introducida por terceros ajenos al prestador.",
	"notice.legal.conditions.responsability.p2": "Este sitio web puede contener enlaces o enlaces que redirijan a los usuarios a otros sitios y páginas web gestionados por terceros, sobre los cuales Jhon Camargo no tiene control alguno. En estos casos, Jhon Camargo actúa como prestador de servicios de intermediación de acuerdo con lo establecido en el artículo 17 de la LSSICE. Jhon Camargo no se responsabiliza ni del contenido ni del estado de dichos sitios y páginas web.",
	"notice.legal.conditions.responsability.p3": "El prestador no se hace responsable de la información y los contenidos almacenados, incluyendo, entre otros, en foros, chats, generadores de blogs, comentarios, redes sociales u otros medios que permitan a terceros publicar contenidos de forma independiente en el sitio web del prestador. Sin embargo, de acuerdo con lo establecido en los artículos 11 y 16 de la LSSICE, el prestador se pone a disposición de todos los usuarios, autoridades y fuerzas de seguridad, colaborando activamente en la retirada o bloqueo de cualquier contenido que pueda infringir la legislación nacional o internacional, los derechos de terceros, o la moral y el orden público.",

	"notice.legal.conditions.intellectual.property.title": "Derechos de propiedad industrial e intelectual",
	"notice.legal.conditions.intellectual.property.p1": "El Usuario reconoce y acepta que todos los derechos de propiedad industrial e intelectual sobre los contenidos y demás elementos insertados en el Sitio Web pertenecen a Jhon Camargo.",
	"notice.legal.conditions.intellectual.property.p2": "El contenido completo del sitio web, incluyendo, entre otros, su programación, edición, compilación y demás elementos necesarios para su funcionamiento, así como los diseños, logotipos, texto y/o gráficos, imágenes y material gráfico o artístico presentes en el sitio web, son propiedad del prestador o cuentan con licencia o autorización expresa por parte de los autores. Todos los contenidos del sitio web están protegidos por derechos de propiedad industrial e intelectual, registrados en los correspondientes registros públicos bajo la titularidad de Jhon Camargo o terceros, y el Usuario no adquiere ningún derecho de explotación sobre los mismos, más allá de lo estrictamente necesario para el uso adecuado de del sitio web.",
	"notice.legal.conditions.intellectual.property.p3": "Se permite a cualquier persona natural o jurídica establecer enlaces en sus páginas o sitios web hacia el sitio web, tanto a su página principal como a cualquiera de sus páginas. Sin embargo, queda expresamente prohibido enlazar directamente a cualquier página del sitio web que implique visualizarlas en un marco o frame dentro del navegador.",

	"notice.legal.conditions.data.protection.title": "Protección de datos",
	"notice.legal.conditions.data.protection.p1": "De acuerdo con la normativa vigente en protección de datos y servicios de la sociedad de la información, el Usuario acepta que los datos personales proporcionados en el momento de contacto u otros facilitados a Jhon Camargo sean compartidos con el propietario, Jhon Camargo, con el fin de recopilar la información necesaria para responder a solicitudes de información, contacto, contratación y/o presupuestos, así como para cobros y pagos.",
	"notice.legal.conditions.data.protection.p2": "Además, se utilizarán para enviar información relevante sobre el tema en cuestión (mensajes del usuario) a través del correo electrónico. El usuario otorga su consentimiento expreso para recibir comunicaciones a través de este medio.",
	"notice.legal.conditions.data.protection.p3": "El Usuario tiene derecho a revocar el consentimiento otorgado para el envío de comunicaciones, así como a ejercer sus derechos de acceso, rectificación, cancelación y oposición. Estos derechos se pueden ejercer mediante una comunicación escrita a través del formulario de contacto.",

	"notice.legal.conditions.law.title": "Ley aplicable y de jurisdicción",
	"notice.legal.conditions.law.p1": "Para resolver cualquier controversia o asunto relacionado con este sitio web o las actividades llevadas a cabo en él, se aplicará la legislación colombiana. Las partes se someten expresamente a dicha legislación y los Juzgados y Tribunales de Bogotá serán competentes para resolver cualquier conflicto derivado o relacionado con el uso del sitio."
}
